import { Button, Result } from 'antd';
import React from 'react';
import { useNavigate } from 'react-router';

/* -------------------------------------------------------------------------- */
/*                                  COMPONENT                                 */
/* -------------------------------------------------------------------------- */

export const ForbiddenPage: React.FC<Props> = () => {
  const navigate = useNavigate();

  const navToHome = React.useCallback(() => navigate('/'), [navigate]);

  /* --------------------------------- RETURN --------------------------------- */

  return (
    <Result
      status="403"
      title="403"
      subTitle="Доступ запрещён: недостаточно прав"
      extra={
        <Button type="primary" onClick={navToHome}>
          На главную
        </Button>
      }
    />
  );
};

/* -------------------------------------------------------------------------- */
/*                                 / COMPONENT                                */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/*                                    TYPES                                   */
/* -------------------------------------------------------------------------- */

interface Props {}

/* -------------------------------------------------------------------------- */
/*                                   / TYPES                                  */
/* -------------------------------------------------------------------------- */
