import React from 'react';
import { TextInput } from 'react-native-paper';

/* -------------------------------------------------------------------------- */
/*                                  COMPONENT                                 */
/* -------------------------------------------------------------------------- */

export const LoginInput = React.memo<Props>(({ login, changeLogin }) => (
  <TextInput
    value={login}
    onChangeText={changeLogin}
    keyboardType="default"
    label="Логин"
    placeholder="Введите логин"
    textContentType="nickname"
  />
));

/* -------------------------------------------------------------------------- */
/*                                 / COMPONENT                                */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/*                                    TYPES                                   */
/* -------------------------------------------------------------------------- */

interface Props {
  readonly login: string;
  readonly changeLogin: (str: string) => void;
}

/* -------------------------------------------------------------------------- */
/*                                   / TYPES                                  */
/* -------------------------------------------------------------------------- */
