import { cleanEnv, host, num, port, str, url } from 'envalid';

export const environment = cleanEnv(process.env, {
  NODE_ENV: str({
    choices: ['production', 'development', 'test'],
  }),

  /* -------------------------------------------------------------------------- */
  /*                                   SERVER                                   */
  /* -------------------------------------------------------------------------- */

  PORT: port({
    example: '7000',
    desc: 'Порт, на котором будет запущен сервер',
  }),

  /* -------------------------------------------------------------------------- */

  HOST: host({
    example: 'nonoart.antogor.ru',
    desc: 'Хост, на котором работает сервер и web-клиент',
  }),

  /* -------------------------------------------------------------------------- */

  URL: url({
    example: 'https://nonoart.antogor.ru',
    desc: 'URL, по которому будет доступны сервер и web-клиент',
  }),

  /* -------------------------------------------------------------------------- */
  /*                                  / SERVER                                  */
  /* -------------------------------------------------------------------------- */

  /* -------------------------------------------------------------------------- */
  /*                               BUSINESS LOGIC                               */
  /* -------------------------------------------------------------------------- */

  LEVEL_GRID_ROW_MAX: num({
    example: '50',
    desc: 'Максимально допустимое количество строк в сетке уровня',
  }),

  /* -------------------------------------------------------------------------- */

  LEVEL_GRID_ROW_MIN: num({
    example: '1',
    desc: 'Минимально допустимое количество строк в сетке уровня',
  }),

  /* -------------------------------------------------------------------------- */

  LEVEL_GRID_COL_MAX: num({
    example: '50',
    desc: 'Максимально допустимое количество столбцов в сетке уровня',
  }),

  /* -------------------------------------------------------------------------- */

  LEVEL_GRID_COL_MIN: num({
    example: '1',
    desc: 'Минимально допустимое количество столбцов в сетке уровня',
  }),

  /* -------------------------------------------------------------------------- */
  /*                              / BUSINESS LOGIC                              */
  /* -------------------------------------------------------------------------- */

  /* -------------------------------------------------------------------------- */
  /*                                 POSTGRESQL                                 */
  /* -------------------------------------------------------------------------- */

  PG_USER: str({
    desc: 'Имя пользователя для подключения к PostgreSQL',
    example: 'dev_user',
    docs: 'https://www.postgresql.org/docs/current/auth-username-maps.html',
  }),

  /* -------------------------------------------------------------------------- */

  PG_PASSWORD: str({
    desc: 'Пароль пользователя PostgreSQL (чувствителен к регистру)',
    example: 'dev_password',
    docs: 'https://www.postgresql.org/docs/current/auth-password.html',
  }),

  /* -------------------------------------------------------------------------- */

  PG_DB: str({
    desc: 'Имя базы данных, к которой будет выполнено подключение',
    example: 'dev_db',
    docs: 'https://www.postgresql.org/docs/current/manage-ag-templatedbs.html',
  }),

  /* -------------------------------------------------------------------------- */

  PG_HOST: host({
    desc: 'Сетевой адрес сервера PostgreSQL (localhost, IP-адрес или доменное имя)',
    example: 'localhost',
    default: 'localhost',
    docs: 'https://www.postgresql.org/docs/current/runtime-config-connection.html',
  }),

  /* -------------------------------------------------------------------------- */

  PG_PORT: port({
    desc: 'TCP-порт, на котором PostgreSQL принимает подключения',
    example: '5432',
    default: 5432,
    docs: 'https://www.postgresql.org/docs/current/runtime-config-connection.html#GUC-PORT',
  }),

  /* -------------------------------------------------------------------------- */
  /*                                / POSTGRESQL                                */
  /* -------------------------------------------------------------------------- */

  /* -------------------------------------------------------------------------- */
  /*                                   SECURE                                   */
  /* -------------------------------------------------------------------------- */

  JWT_ACCESS_SECRET: str(),

  /* -------------------------------------------------------------------------- */

  JWT_REFRESH_SECRET: str(),

  /* -------------------------------------------------------------------------- */

  JWT_ACCESS_EXPIRES_IN: num({
    example: '1800 ( 30 минут )',
    desc: 'Время жизни JWT токена доступа в секундах',
  }),

  /* -------------------------------------------------------------------------- */

  JWT_REFRESH_EXPIRES_IN: num({
    example: '2592000 ( 30 дней )',
    desc: 'Время жизни JWT токена обновления доступа в секундах',
  }),

  /* -------------------------------------------------------------------------- */

  SALT: str(),

  /* -------------------------------------------------------------------------- */

  COOKIE_SECRET: str(),

  /* -------------------------------------------------------------------------- */
  /*                                  / SECURE                                  */
  /* -------------------------------------------------------------------------- */

  /* -------------------------------------------------------------------------- */
  /*                                    OTHER                                   */
  /* -------------------------------------------------------------------------- */

  GRACEFUL_SHUTDOWN_TIMEOUT_MS: num({
    default: 10000,
    example: '10000',
    desc: 'Таймаут принудительного отключения сервера при аварийном отключении',
  }),

  /* -------------------------------------------------------------------------- */

  SERVER_LOG_LEVEL: str({
    choices: ['fatal', 'error', 'warn', 'info', 'http', 'sql', 'debug', 'trace'],
    example: 'info',
    desc: 'Уровень вывода логов',
  }),

  /* -------------------------------------------------------------------------- */
  /*                                   / OTHER                                  */
  /* -------------------------------------------------------------------------- */
});
